#include <stdio.h>

int main() {
    /*
        指针运算有意义的操作：
            指针跟整数进行加减操作（每次移动一个步长）
            指针跟指针进行减操作 （间隔步长）

        指针运算无意义的操作：
            指针跟整数进行乘除操作
            指针跟指针进行加、乘除操作
    */

    // 前提条件：内存空间连续
    int arr[] = {1,2,3,4,5,6,7,8,9,10};

    int* p1 = &arr[0];
    printf("%d\n", *p1);
    printf("%d\n", *(p1 + 1)); // 指针和整数进行加减操作

    // 获取5索引的内存地址
    int* p2 = &arr[5];

    // p2 - p1 获取两个指针之间的间隔
    printf("%d\n", p2 - p1); // 5 * 4 = 20 字节

    return 0;
}